# VIDEO GAMES ANALYSIS <img src="video_games.jpg">

# OVERVIEW

This analysis aims to explore video game sales data with a focus on identifying trends and insights. The study will include the following key objectives:

Global Sales Analysis: Examine the top 100 most-sold games globally to identify sales patterns and performance.<p/>
Genre and Platform Analysis: Analyze video game sales based on genres and platforms to understand preferences and trends.<p/>
Regional Genre Preferences: Investigate game genres across different regions to identify variations in regional preferences.<p/>
Game Title Insights: Generate a word cloud based on game titles to highlight popular themes or keywords.<p/>
Release Year and Publisher Analysis: Analyze the release years of the top 1000 most-sold games and their associated publishers to identify historical trends and key contributors.<p/>
Descriptive Insights: Provide additional information about games, publishers, and platforms for context and understanding.<p/>
This comprehensive analysis will offer valuable insights into the video game industry, helping to understand the factors driving sales and popularity.<p/>

### Dataset
number of rows  16598 <p/>
number of columns 11  <p/>

### Import necessary libraries

In [1]:
import pandas as pd
import numpy as np
import dtale

### Load data

In [2]:
pd.read_csv("titanic.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

### Explore the dataset
Inspect the structure and summary of the dataset

In [3]:
df=pd.read_csv("titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

### Data Cleaning

Issue1:
Plan:

In [7]:
#check for null values
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [8]:
# get column names
print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
# handling missing values
# fill missing age with 0
df["Age"]=df["Age"].fillna(0)

In [10]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [11]:
# drop missing cabin
df=df.dropna()

In [12]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### Handling duplicates

In [13]:
print(df.duplicated())

12     False
14     False
24     False
26     False
28     False
       ...
404    False
405    False
407    False
411    False
414    False
Length: 91, dtype: bool

#### there are no duplicates

### Data types conversion

In [14]:
# convert age from float to object
df["Age"]=df["Age"].astype(object)

### Filtering data

In [15]:
filtered_df=df[df["Age"]>20]

### Sorting data

In [16]:
sort_df=df.sort_values(by='Fare', ascending = True)

In [17]:
sort_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
372,1264,0,1,"Ismay, Mr. Joseph Bruce",male,49.0,0,0,112058,0.0000,B52 B54 B56,S
321,1213,0,3,"Krekorian, Mr. Neshan",male,25.0,0,0,2654,7.2292,F E57,C
288,1180,0,3,"Mardirosian, Mr. Sarkis",male,0.0,0,0,2655,7.2292,F E46,C
57,949,0,3,"Abelseth, Mr. Olaus Jorgensen",male,25.0,0,0,348122,7.6500,F G63,S
222,1114,1,2,"Cook, Mrs. (Selena Rogers)",female,22.0,0,0,W./C. 14266,10.5000,F33,S
...,...,...,...,...,...,...,...,...,...,...,...,...
59,951,1,1,"Chaudanson, Miss. Victorine",female,36.0,0,0,PC 17608,262.3750,B61,C
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
69,961,1,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,19950,263.0000,C23 C25 C27,S
53,945,1,1,"Fortune, Miss. Ethel Flora",female,28.0,3,2,19950,263.0000,C23 C25 C27,S
343,1235,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C

### group by and aggregation

In [18]:
grouped_titanic=df.groupby('Sex').sum()

In [19]:
grouped_titanic

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,48200,44,49,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)C...",1742.0,31,28,21228W.E.P. 5734PC 17608113509117531181319950P...,4999.5752,B45E31B57 B59 B63 B66B36D19D15C23 C25 C27B61C2...,SSCCSCSCSCSSSCCSSCCSSCSCCCSCCSCSCCSCCSSSCSQC
male,52080,0,57,"Brady, Mr. John BertramMock, Mr. Philipp Edmun...",1672.5,21,14,11305413236113778PC 1759413695348122PC 1760825...,3636.6125,A21C78D34A9C31F G63B57 B59 B63 B66C53D43C132C5...,SCSCSSCCCCSSCCCSSCCCCCSCCCSCCSCSCSSCCSCSSSSSCCC

In [20]:
vg=pd.read_csv("vgsales.csv")

### Data Undestanding

In [21]:
vg.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [22]:
vg.sample(5)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
9484,9486,Rango: The Video Game,X360,2011.0,Action,Electronic Arts,0.06,0.06,0.00,0.01,0.13
8043,8045,AirForce Delta Storm,XB,2001.0,Shooter,Konami Digital Entertainment,0.14,0.04,0.00,0.01,0.18
11486,11488,Line Rider 2: Unbound,DS,2008.0,Puzzle,Deep Silver,0.07,0.00,0.00,0.01,0.08
9796,9798,Ecco the Dolphin,GEN,1992.0,Adventure,Sega,0.00,0.00,0.12,0.00,0.12
12847,12849,Princess on Ice,DS,2008.0,Sports,505 Games,0.04,0.01,0.00,0.00,0.05

In [23]:
# dtale.show(vg, open_browser=True)

In [24]:
# number of columns and rows
vg.shape

(16598, 11)

### Data Cleaning

### year contains missing values

In [25]:
vg[["Year", "Publisher"]].isna().sum()

Year         271
Publisher     58
dtype: int64

In [26]:
vg["Year"].isna().sum()

271

In [27]:
# fill na in year
vg["Year"]=vg["Year"].fillna(method = 'ffill')

In [28]:
# to have an idea of the value count for each publisher
vg["Publisher"].value_counts()

Publisher
Electronic Arts                 1351
Activision                       975
Namco Bandai Games               932
Ubisoft                          921
Konami Digital Entertainment     832
                                ...
Warp                               1
New                                1
Elite                              1
Evolution Games                    1
UIG Entertainment                  1
Name: count, Length: 578, dtype: int64

In [29]:
# to get the list of publisher with null
missing_publisher = vg[vg["Publisher"].isnull()]

In [30]:
# missing_publisher.to_csv("missing_publisher")

In [31]:
vg.dropna(inplace=True)

test: check missing value result

In [57]:
vg.head()

,Rank,Movie_Title,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sum
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.83
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.38

In [59]:
vg["Year"].isna().sum()

0

In [32]:
vg.isna().sum()

Rank            0
Name            0
Platform        0
Year            0
Genre           0
Publisher       0
NA_Sales        0
EU_Sales        0
JP_Sales        0
Other_Sales     0
Global_Sales    0
dtype: int64

Issue 2 : year is a string</p>
plan:change year to string

In [33]:
def cleandate(x):   
    if x == 'nan' or pd.isna(x):
        return x
    # Remove '.0' and return the year as a string
    return str(int(float(x)))

In [34]:
vg["Year"]=vg["Year"].apply(cleandate)

### Missing Data
-Isolation</p>
-fill or drop with notes on related pages

#### plan
-isolate the missing data to share with the stakeholders. also include link to the csv in the appendix of the final report
-drop missing data

In [35]:
vg.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

issue : year contains 0

In [36]:
vg["Year"].unique()

array(['2006', '1985', '2008', '2009', '1996', '1989', '1984', '2005',
       '1999', '2007', '2010', '2013', '2004', '1990', '1988', '2002',
       '2001', '2011', '1998', '2015', '2012', '2014', '1992', '1997',
       '1993', '1994', '1982', '2003', '1986', '2000', '1995', '2016',
       '1991', '1981', '1987', '1980', '1983', '2020', '2017'],
      dtype=object)

In [37]:
vg.dtypes

Rank              int64
Name             object
Platform         object
Year             object
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [38]:
vg.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

Issue2: year and publisher has missing values</P>year: 272 columns</p>
publisher 56 columns</p>
plan:fill year with the mode</p>
code:

In [39]:
# add new column to confirm if global sales is the sum of all sales
vg["test_sum"]=vg["NA_Sales"]+vg["EU_Sales"]+vg["JP_Sales"]+vg["Other_Sales"]

In [40]:
# confirmation, it is confirmed that Global sales is the sum of all sales
vg.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,test_sum
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82,35.83
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,31.38

In [41]:
# compare the value between the rounded global sales and test sum
vg["check"]= vg["Global_Sales"].round(1)==vg["test_sum"].round(1)

In [42]:
vg.check

0        True
1        True
2        True
3        True
4        True
         ...
16593    True
16594    True
16595    True
16596    True
16597    True
Name: check, Length: 16540, dtype: bool

In [43]:
vg[vg["check"] == False]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,test_sum,check
32,33,Pokemon X/Pokemon Y,3DS,2013,Role-Playing,Nintendo,5.17,4.05,4.34,0.79,14.35,14.35,False
47,48,Gran Turismo 4,PS2,2004,Racing,Sony Computer Entertainment,3.01,0.01,1.10,7.53,11.66,11.65,False
85,86,Mario & Sonic at the Olympic Games,Wii,2007,Sports,Sega,2.58,3.90,0.66,0.91,8.06,8.05,False
154,155,Destiny,PS4,2014,Shooter,Activision,2.49,2.05,0.16,0.96,5.65,5.66,False
176,177,Assassin's Creed II,X360,2009,Action,Ubisoft,3.10,1.56,0.08,0.51,5.27,5.25,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13002,13004,Ferrari F355 Challenge,PS2,2002,Racing,Sony Computer Entertainment,0.03,0.02,0.00,0.01,0.05,0.06,False
13010,13012,Shifters,PS2,2002,Adventure,3DO,0.03,0.02,0.00,0.01,0.05,0.06,False
13042,13044,Downforce,PS2,2002,Racing,Avalon Interactive,0.03,0.02,0.00,0.01,0.05,0.06,False
13043,13045,Bejeweled Twist,PC,2008,Puzzle,PopCap Games,0.01,0.04,0.00,0.01,0.05,0.06,False
13189,13191,LEGO Indiana Jones 2: The Adventure Continues,PC,2009,Action,Activision,0.02,0.03,0.00,0.01,0.05,0.06,False

issue2 : some rows in global sales are not direct sum of the individual sales as confirmed above</p>
description: some cumulative value are incorrect by decimals in most cases, this might have been caused by possible rounding off</p>
Solution: keep the new calsulated test sum and delete the global sum column

In [44]:
# Rename test_sum to global_sum
vg.rename({"test_sum":"Global_Sum", "Name":"Movie_Title"}, axis=1, inplace = True)

In [45]:
vg.rename({"test_sum": "Global_Sum"}, axis=1, inplace=True)

Test: check if the column were properly renamed

In [46]:
vg.columns

Index(['Rank', 'Movie_Title', 'Platform', 'Year', 'Genre', 'Publisher',
       'NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales',
       'Global_Sum', 'check'],
      dtype='object')

In [47]:
vg.drop(["Global_Sales", "check"], axis =1, inplace = True)

In [48]:
# check if columns were properly deleted
vg.columns

Index(['Rank', 'Movie_Title', 'Platform', 'Year', 'Genre', 'Publisher',
       'NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sum'],
      dtype='object')

In [49]:
vg.dtypes

Rank             int64
Movie_Title     object
Platform        object
Year            object
Genre           object
Publisher       object
NA_Sales       float64
EU_Sales       float64
JP_Sales       float64
Other_Sales    float64
Global_Sum     float64
dtype: object

In [50]:
vg.isna().sum()

Rank           0
Movie_Title    0
Platform       0
Year           0
Genre          0
Publisher      0
NA_Sales       0
EU_Sales       0
JP_Sales       0
Other_Sales    0
Global_Sum     0
dtype: int64

In [51]:
vg.head()

,Rank,Movie_Title,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sum
0,1,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.83
3,4,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.38

### Research questions
which publisher is the best performing publisher <p/>
we are planing to shut down the least performing genre <p/>
does age has an impact on survival in titanic

In [52]:
vg50 = vg["Global_Sum"]>50

In [53]:
# sum of sales for sport and platform genre
vg[(vg["Genre"] == "Sport") | (vg["Genre"] == "Platform")]["Global_Sum"].sum()

830.54

In [54]:
# USING QUERY
vg.query("Genre == 'Sport' or Genre == 'Platform'")["Global_Sum"].sum()

830.54

In [55]:
# what i the total sales racing category in 2006 
# sum of sales for sports and platform
vg[(vg['Genre'] == "Racing") & (vg['Year'] == 2008.0)] ["Global_Sum"].sum()

0.0

In [56]:
#top five movies in europe
vg.sort_values(by="EU_Sales", ascending = False)[["Name","EU_Sales"]].head(5)

KeyError: "['Name'] not in index"

### Grouping

In [ ]:
# total sales by genre
vg.groupby("Genre")["Global_Sum"].sum()

In [ ]:
# average sales by genre
vg[["Genre", "EU_Sales", "Global_Sum"]].groupby("Genre").mean()

In [ ]:
# total sales by genre
df.groupby("Genre").agg({"Global_Sales": ['count', 'mean','sum']})